attempts = int(input('сколько попыток?'))
while attempts > 0:
    letter = 0
    vowels = 0
    consonants = 0
    word = input('Ввидите слову на латиница или крилица ')
    if word.lower() == 'выход':
        break

    for i in word:
        if i.lower() in ('a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y','z','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я'):
            letter += 1
    print(f'количеество букв{letter}')


    for i in word:
        if i.lower() in ('e','y','u','i','o','a','у','е','ы','а','о','э','я','и','ю'):
            vowels += 1
    print(f' гласные буквы{vowels}')

    for i in word:
        if i.lower() in ('q','w','r','t','p','s','d','f','g','h','j','k','l','z','x','c','v','b','n','m',
                         'й','ц','к','н','г','ш',
                         'щ','з','х','ф','в','п','р','л','д','ж','ч','с','м','т','б'):
            consonants += 1
    print(f'сагласные буквы {consonants}')
    print(f'согласных: {(consonants / letter) * 100:1f} %')
    print(f'гласных быквы{(vowels / letter) * 100:1f} %')('q','w','r','t','p','s','d','f','g',
    'h','j','k','l','z','x','c','v','b','n','m',
    'е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я'):
            letter += 1
    print(f'количеество букв {letter}')

    for i in word:
        if i.lower() in ('e','y','u','i','o','a','у','е','ы','а','о','э','я','и','ю'):
            vowels += 1
    print(f' гласные буквы{vowels}')

    for i in word:
        if i.lower() in
    ('q','w','r','t','p','s','d','f','g','h','j','k','l','z','x','c','v','b','n','m'):
